

import re
def replace_strings(text):
    emoji_pattern = re.compile("["
                           u"\U0001F600-\U0001F64F"  # emoticons
                           u"\U0001F300-\U0001F5FF"  # symbols & pictographs
                           u"\U0001F680-\U0001F6FF"  # transport & map symbols
                           u"\U0001F1E0-\U0001F1FF"  # flags (iOS)
                           u"\U00002702-\U000027B0"
                           u"\U000024C2-\U0001F251"
                           u"\u00C0-\u017F"          #latin
                           u"\u2000-\u206F"          #generalPunctuations
                           u"\xa0"
                               
                           "]+", flags=re.UNICODE)
    english_pattern=re.compile('[a-zA-Z0-9]+', flags=re.I)
    #latin_pattern=re.compile('[A-Za-z\u00C0-\u00D6\u00D8-\u00f6\u00f8-\u00ff\s]*',)
    
    text=emoji_pattern.sub(r'', text)
    text=english_pattern.sub(r'', text)

    return text





def remove_punctuations(text):
    # define punctuation
    punctuations = '''````£|¢|Ñ+-*/=EROero৳০১২৩৪৫৬৭৮৯012–34567•89।!()-[]{};:'"“\’,<>./?@#$%^&*_~‘—॥”‰⚽️✌�￰৷￰'''
    
    no_punct = ""
    for char in text:
        if char not in punctuations:
            no_punct = no_punct + char

    # display the unpunctuated string
    return no_punct





stop_words=['থাকা', 'আমরা', 'সেই', 'আমাদের', 'কিছু', 'হওয়া', 'তিনি', 'এঁদের', 'কেউ', 'সেখান', 'করিতে', 'আপনার', 'আপনি', 'যার', 'যিনি', 'হইতে',
     'সবার', 'নিয়ে', 'ইহা', 'এস', 'উনি', 'যাঁরা', ' ই', 'কখনও', 'হইয়া', 'সঙ্গেও', 'ফিরে', 'সেখানে', 'হবেন', 'মতোই', 'তোমার', 'থেকে', 'তাকে',
     'করলেন', 'থেকেও', 'হোক', 'উপর', 'পরেই', 'যাওয়ার', 'কিছুই', 'নাগাদ', 'জানতে', 'অনুযায়ী', 'যে', 'ও', 'হয়েছে', 'অনেকেই', 'সেটা', 'সম্প্রতি',
     'দিলেন', 'পারে', 'করার', 'করে', 'এতে', 'কী', 'ছিল', 'ফলে', 'ধরা', 'এদের', 'পক্ষে', 'স্পষ্ট', 'ভাবে', 'তাহা', 'চলে', 'আজ', 'যখন', 'করবে', 'যথেষ্ট',
     'তথা', 'হয়', 'হত', 'থাকেন', 'আরও', 'যত', 'মোট', 'ফের', 'সুতরাং', 'যেমন', 'নয়', 'কাজে', 'তাঁদের', 'অথচ', 'হল', 'তুমি', 'নানা', 'তাহাতে', 'এমন',
     'পেয়ে', 'গিয়েছে', 'বিষয়টি', 'তাও', 'শুধু', 'করাই', 'নিজেদের', 'আছে', 'তবু', 'ব্যাপারে', 'হওয়ার', 'ওঁদের', 'হতে', 'বলেন', 'নেই', 'ওরা', 'বিভিন্ন', 'হলেও',
     'বেশ', 'রাখা', 'এত', 'সেটি', 'খুব', 'করবেন', 'নিজের', 'যান', 'এঁরা', 'নিতে', 'দিয়ে', 'ওঁরা', 'থাকবে', 'ঐ', 'গুলি', 'দেখতে', 'তিনঐ', 'যেতে', 'কাউকে', 
     'কারণ', 'অবধি', 'এটা', 'মধ্যভাগে', 'দুটো', 'এবার', 'গোটা', 'নেওয়ার', 'কাছে', 'সে', 'কোন', 'কি', 'যা', 'তাই', 'পরেও', 'অন্য', 'হয়ে', 'করছেন', 'হতেই',
     'ছাড়া', 'করি', 'থাকবেন', 'নিজে', 'কারও', 'আদ্যভাগে', 'ছাড়াও', 'হলে', 'টি', 'হচ্ছে', 'এরা', 'গেল', 'এমনকী', 'আমি', 'করেন', 'অবশ্য', 'না', 'বহু',
     'তারপর', 'এল', 'এখানেই', 'জন্যওজে', 'ওকে', 'ওর', 'নাই', 'সেটাই', 'বলেছেন', 'এখন', 'ঠিক', 'বা', 'আই', 'করেছেন', 'যাচ্ছে', 'হয়নি', 'দেয়', 'হয়তো', 
     'একবার', 'তাহলে', 'গেলে', 'কবে', 'হইবে', 'করা', 'জানায়', 'চায়', 'একে', 'রয়েছে', 'অর্থাত', 'যাবে', 'আগামী', 'হওয়ায়', 'করায়', 'দেওয়া', 'করেই', 'যাদের',
     'ভাবেই', 'তেমন', 'তা', 'বসে', 'জানিয়েছে', 'ছিলেন', 'চান', 'তাঁকে', 'দিকে', 'তাহার', 'একই', 'জন', 'কে', 'ব্যবহার', 'গেছে', 'নেওয়া', 'কত', 'ধরে', 'অনেক', 
     'কেউই', 'রকম', 'কিন্তু', 'হয়েছেন', 'যাতে', 'সব', 'তাঁর', 'বিশেষ', 'কোনও', 'যারা', 'বললেন', 'সমস্ত', 'ওখানে', 'প্রভৃতি', 'হিসাবে', 'পারেন', 'নিজেই', 'প্রায়',
     'স্বয়ং', 'করতে', 'দেন', 'একটি', 'পারি', 'করেছে', 'দেখা', 'দু', 'থাকায়', 'দিয়েছে', 'দিয়েছেন', 'আগেই', 'যদিও', 'দুটি', 'এই', 'এটি', 'দ্বারা', 'দিতে', 'তাঁরা', 
     'হলেই', 'করিয়া', 'করেছিলেন', 'কেন', 'আমার', 'সহিত', 'জানিয়ে', 'থাকে', 'তবে', 'যাকে', 'তার', 'ওই', 'তারৈ', 'হয়েছিল', 'অন্তত', 'এতটাই', 'বদলে', 'কয়েকটি',
     'তারা', 'জানানো', 'ক্ষেত্রে', 'বরং', 'জনের', 'আবার', 'যাঁর', 'প্রতি', 'মধ্যেই', 'জানা', 'এবং', 'কোনো', 'মোটেই', 'উচিত', 'রেখে', 'মধ্যে', 'চেয়ে', 'সেটাও', 
     'মতো', 'করলে', 'পর', 'বলল', 'এসে', 'এখানে', 'হবে', 'নাকি', 'হলো', 'জন্য', 'যদি', 'ওদের', 'কয়েক', 'মাধ্যমে', 'অথবা', 'আমাকে', 'যতটা', 'দেখে', 'যায়', 
     'করিয়ে', 'তখন', 'আগে', 'হৈলে', 'তত', 'এটাই', 'তো', 'যেখানে', 'বাদে', 'তাতে', 'তিনিও', 'থেকেই', 'কিংবা', 'গিয়ে', 'হন', 'যেন', 'বলে', 'মাত্র', 'সঙ্গে', 
     'বিনা', 'যাওয়া', 'অনেকে', 'করছে', 'দেওয়ার', 'উপরে', 'হয়েই', 'পর্যন্ত', 'জনকে', 'বলা', 'বলতে', 'পাওয়া', 'তাদের', 'মধ্যেও', 'আর', 'এখনও', 'ওঁর', 
     'তাঁহারা', 'কাছ', 'তুলে', 'এ', 'পরে', 'জে', 'এর', 'সহ', 'ইত্যাদি', 'বার', 'অতএব']





#from bnltk.stemmer import BanglaStemmer
#from application.app.bangla_stemmer.stemmer import stemmer

import os
import sys
nb_dir = os.path.split(os.getcwd())[0]
if nb_dir not in sys.path:
    sys.path.append(nb_dir)

from bangla_stemmer.stemmer import stemmer
    
def tokenize(text):
    words = text.split(" ")
    tokens = [ w for w in words if w not in stop_words and w!= "" ]
    #bn_stemmer = BanglaStemmer()
    stmr = stemmer.BanglaStemmer()
    tokens = ' '.join([stmr.stem(token) for token in tokens])
    return tokens





def bangla_text_preprocess(sentences):
    formattedSentences = []
    for sentence in sentences:
        sentence = replace_strings(sentence)
        sentence = remove_punctuations(sentence)
        tokens = tokenize(sentence)
        formattedSentences.append(tokens) 
    return formattedSentences


